Catalogs/СпособыРаспределенияЗатратНаВыпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>СпособыРаспределенияЗатратНаВыпуск</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияЗатратНаВыпуск</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияЗатратНаВыпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФильтраПриРаспределенииЗатратНаВыпуск</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФильтровПриРаспределенииЗатратНаВыпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРаспределенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБазыРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоказателейБазыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеСырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновноеСырье</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределенияЗатратПоПодразделениям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыРаспределенияЗатратНаВыпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаСобственнуюПродукцию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаПродукциюСтороннегоПереработчика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаПродукциюИзДавальческогоСырья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаПодчиненныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьНаНаработку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьНаПроцент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменитьНаКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглитьДо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Применимость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХарактерЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПростоеРаспределение</Name>
					<Comment>При использовании этой базы распределение будет выполняться алгоритмом, основанным на схемах компоновки данных</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияРаспределенияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаПрименять</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБазыРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБазРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Фильтры</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределенияНаВыпуск</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределенияНаЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БазаРаспределенияНаРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаНУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыБазРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыБазРаспределения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Предопределенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табличный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СпособыРаспределенияЗатратНаВыпуск/Forms/ФормаСпискаУправляемая/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////
//  ОБРАБОТЧИКИ СОБЫТИЙ

// НА СЕРВЕРЕ

// Процедура - обработчик события "ПриСозданииНаСервере" формы списка справочника
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Установим значение реквизитов формы
	мИспользоватьГибкуюНастройкуСпособовРаспределенияЗатрат = УчетЗатрат.ИспользоватьГибкуюНастройкуСпособовРаспределенияЗатрат();
	мСКДСпособ 		 										= Перечисления.ТипыБазРаспределения.СКД;
	мТабличныйСпособ 										= Перечисления.ТипыБазРаспределения.Табличный;
	
	// Установим видимость кнопок "Создать"
	НевидимыйЭлемент = Элементы.Найти(
		?(мИспользоватьГибкуюНастройкуСпособовРаспределенияЗатрат,
			"ГруппаСоздать",
			"КнопкаСоздать"));
	// Если у пользователя нет права на добавление, то элемент формы будет "спрятан" самой платформой
	Если НевидимыйЭлемент <> Неопределено Тогда
		НевидимыйЭлемент.Видимость = Ложь;
	КонецЕсли;
	
	// Установим режим выбора формы
	Элементы.Список.РежимВыбора 	 = Параметры.РежимВыбора;
	Элементы.КнопкаВыбрать.Видимость = Параметры.РежимВыбора;
	
	// Установим отбор в списке
	Если Параметры.Свойство("ОтборКомпоновкиДанных") Тогда
		ОбщегоНазначенияКлиентСервер.СкопироватьЭлементы(Список.Отбор, Параметры.ОтборКомпоновкиДанных);
	КонецЕсли;
	
КонецПроцедуры

// НА КЛИЕНТЕ

// Процедура - обработчик события "ПередНачаломДобавления" таблицы Список
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если мИспользоватьГибкуюНастройкуСпособовРаспределенияЗатрат Тогда
		ОткрытьФормуНовогоСпособаРаспределения(мПустойСпособ, Копирование, Отказ);
	Иначе
		ОткрытьФормуНовогоСпособаРаспределения(мТабличныйСпособ, Копирование, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПередНачаломИзменения" таблицы Список
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Если мИспользоватьГибкуюНастройкуСпособовРаспределенияЗатрат
	 И ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
			
			ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
			
			Если НЕ ТекущаяСтрока.ИспользоватьПростоеРаспределение Тогда
				
				// открываем обычную (не управляемую) форму существующего способа распределения
				Отказ = Истина;
				
				ФормаЭлемента = ТекущаяСтрока.ПолучитьФорму("ФормаЭлемента", Элементы.Список);
				ФормаЭлемента.Открыть();
				
				Возврат;
				
			КонецЕсли;
			
	КонецЕсли;
	
	// по умолчанию откроется управляемая форма существующего способа распределения
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////
//  ОБРАБОТЧИКИ КОМАНД (НА КЛИЕНТЕ)

// Процедура - обработчик команды "СоздатьСпособСКД"
//
&НаКлиенте
Процедура СоздатьСпособСКД(Команда)
	
	ОткрытьФормуНовогоСпособаРаспределения(мСКДСпособ);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////
//  ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// НА СЕРВЕРЕ

// Создает и заполняет новый способ распределения, не использующий гибкий алгоритм распределения расходов
//
&НаСервере
Функция СоздатьСпособРаспределенияСервер(СтруктураПараметры, Копирование)
	
	Если Копирование Тогда // копирование существующего способа
		НовыйСпособ = СтруктураПараметры.ЗначениеКопирования.Скопировать();
	Иначе // добавление нового способа
		НовыйСпособ = Справочники.СпособыРаспределенияЗатратНаВыпуск.СоздатьЭлемент();
		НовыйСпособ.Заполнить(СтруктураПараметры.ЗначенияЗаполнения);
	КонецЕсли;
	
	НовыйСпособ.ТипБазыРаспределения = мПустойСпособ; // для "старых" способов тип базы всегда пустой
	
	Возврат НовыйСпособ;
	
КонецФункции

// НА КЛИЕНТЕ

// Открывает форму (обычную или управляемую) для нового способа распределения
//
&НаКлиенте
Процедура ОткрытьФормуНовогоСпособаРаспределения(ТипБазыРаспределения, Копирование = Ложь, Отказ = Ложь)
	
	Отказ = Истина; // переопределим типовое поведение формы
	
	ТекущаяСтрока 		 = Элементы.Список.ТекущаяСтрока;
	// Определим, является ли текущая строка строкой группировки или строкой способа распределения
	ЭтоСтрокаГруппировки = (ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка"));
	ЭтоСтрокаСпособаРаспределения = (ТипЗнч(ТекущаяСтрока) = Тип("СправочникСсылка.СпособыРаспределенияЗатратНаВыпуск"));
	
	// Создадим и заполним структуру параметров для открытия формы нового способа распределения
	СтруктураПараметры = Новый Структура("ЗначенияЗаполнения", Новый Структура);
	СтруктураПараметры.ЗначенияЗаполнения.Вставить("ТипБазыРаспределения", ТипБазыРаспределения);
		
	Если ЭтоСтрокаСпособаРаспределения Или (ЭтоСтрокаГруппировки И ТекущаяСтрока.ИмяГруппировки = "НаправлениеРаспределения") Тогда
		// Если текущая строка это строка способа распределения или строка группировки по направлению распределения,
		// то вставим в параметр заполнения значение направления распределения
		СтруктураПараметры.ЗначенияЗаполнения.Вставить(
			"НаправлениеРаспределения", ?(ЭтоСтрокаГруппировки, ТекущаяСтрока.Ключ, Элементы.Список.ТекущиеДанные.НаправлениеРаспределения));
	КонецЕсли;
	
	Если Копирование Тогда
		СтруктураПараметры.Вставить("ЗначениеКопирования", ТекущаяСтрока);
	КонецЕсли;
	
	Если мИспользоватьГибкуюНастройкуСпособовРаспределенияЗатрат
	 И ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
		
		// открываем обычную (не управляемую) форму нового способа распределения
		НовыйСпособ = СоздатьСпособРаспределенияСервер(СтруктураПараметры, Копирование);
		НовыйСпособ.ПолучитьФорму("ФормаЭлемента", Элементы.Список).Открыть();
		
		Возврат;
		
	КонецЕсли;
	
	// открываем управляемую форму нового способа распределения
	ОткрытьФорму("Справочник.СпособыРаспределенияЗатратНаВыпуск.ФормаОбъекта", СтруктураПараметры, Элементы.Список);
	
КонецПроцедуры
